OdTextProperties.setGlyph(System.Boolean)
\details
Controls the kIsGlyph flag for this TextProperties object.
\param value [in] Property value to control the flag.

OdTextProperties.isGlyph
\details
Checks whether the kIsGlyph flag is set for this TextProperties object.
\returns The true value if the kIsGlyph flag is set for this TextProperties object, or false otherwise.

OdTextProperties.setLastPosOnly(System.Boolean)
\details
Controls the kLastPosOnly flag for this TextProperties object.
\param value [in] Property value to control the flag.

OdTextProperties.isLastPosOnly
\details
Checks whether the kLastPosOnly flag is set for this TextProperties object.
\returns The true value if the kLastPosOnly flag is set for this TextProperties object, or false otherwise.

OdTextProperties.setSetTriangleCache(System.Boolean)
\details
Controls the kTringleCache flag for this TextProperties object.
\param value [in] Property value to control the flag.

OdTextProperties.isTriangleCache
\details
Checks whether the kTringleCache flag is set for this TextProperties object.
\returns The true value if the kTringleCache flag is set for this TextProperties object successfully, or false otherwise.

OdTextProperties.setTextQuality(System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Sets the text quality percent for this vectorization process.
\param val [in] Property value to set.
\remarks
Sets a value in the range [0,100].
The default is 50.

OdTextProperties.textQuality
\details
Gets the text quality percent for this vectorization process.
\returns The text quality percent for this vectorization process.
\remarks
Returns a value in the range [0,100].
The default is 50.

OdTextProperties.setTrackingPercent(System.Double)
\details
Sets the tracking percent for this TextProperties object.
\param trackingPercent [in] Tracking percent to set.

OdTextProperties.trackingPercent
\details
Gets the tracking percent for this TextProperties object.
\returns The tracking percent for this TextProperties object.

OdTextProperties.setTtfPolyDraw(System.Boolean)
\details
Sets the smooth TrueType font text contour output flag.
\param bFlag [in] New flag value.

OdTextProperties.ttfPolyDraw
\details
Gets the smooth TrueType font text contour output flag.
\returns The smooth TrueType font text contour output flag.

OdTextProperties.setZeroNormals(System.Boolean)
\details
Controls the kZeroNormals flag for this TextProperties object.
\param value [in] Property value to control the flag.

OdTextProperties.isZeroNormals
\details
Checks whether the kZeroNormals flag is set for this TextProperties object.
\returns The true value if the zeroNormals flag is set for this TextProperties object successfully, or false otherwise.

OdTextProperties.setIncludePenups(System.Boolean)
\details
Controls the includePenups flag for this TextProperties object.
\param value [in] Property value to control the flag.

OdTextProperties.isIncludePenups
\details
Checks whether the includePenups flag is set for this TextProperties object.
\returns The true value if the includePenups flag is set for this TextProperties object successfully, or false otherwise.

OdTextProperties.setInBigFont(System.Boolean)
\details
Controls the inBigFont flag for this TextProperties object.
\param value [in] Property value to control the flag.

OdTextProperties.isInBigFont
\details
Checks whether the inBigFont flag is set for this TextProperties object.
\returns The true value if the inBigFont flag is set for this TextProperties object successfully, or false otherwise.

OdTextProperties.setLastChar(System.Boolean)
\details
Controls the lastChar flag for this TextProperties object.
\param value [in] Property value to control the flag.

OdTextProperties.isLastChar
\details
Checks whether the lastChar flag is set for this TextProperties object.
\returns The true value if the lastChar flag is set for this TextProperties object successfully, or false otherwise.

OdTextProperties.setStriked(System.Boolean)
\details
Controls the striked flag for this TextProperties object.
\param value [in] Property value to control the flag.

OdTextProperties.isStriked
\details
Checks whether the striked flag is set for this TextProperties object.
\returns The true value if the striked flag is set for this TextProperties object successfully, or false otherwise.

OdTextProperties.setOverlined(System.Boolean)
\details
Controls the overlined flag for this TextProperties object.
\param value [in] Property value to control the flag.

OdTextProperties.isOverlined
\details
Checks whether the overlined flag is set for this TextProperties object.
\returns The true value if the overlined flag is set for this TextProperties object successfully, or false otherwise.

OdTextProperties.setUnderlined(System.Boolean)
\details
Controls the underlined flag for this TextProperties object.
\param value [in] Property value to control the flag.

OdTextProperties.isUnderlined
\details
Checks whether the underlined flag is set for this TextProperties object.
\returns The true value if the underlined flag is set for this TextProperties object successfully, or false otherwise.

OdTextProperties.setVerticalText(System.Boolean)
\details
Controls the vertical text flag for this TextProperties object.
\param value [in] Property value to control the flag.

OdTextProperties.isVerticalText
\details
Checks whether the vertical text flag is set for this TextProperties object.
\returns The true value if the vertical text flag is set for this TextProperties object successfully, or false otherwise.

OdTextProperties.setNormalText(System.Boolean)
\details
Controls the normal text flag for this TextProperties object.
\param value [in] Property value to control the flag.

OdTextProperties.isNormalText
\details
Checks whether the normal text flag is set for this TextProperties object.
\returns The true value if the normal text flag is set for this TextProperties object successfully, or false otherwise.

OdTextProperties.m_prevChar
Previous character

OdTextProperties.m_textQuality
Text quality in the range [0,100]

OdTextProperties.m_flags
Text flags

OdTextProperties.m_trackingPercent
Tracking percent